In [1]:
import pandas as pd

### 1.데이터 불러오기

In [2]:
selloutData = pd.read_csv("../dataset/kopo_channel_seasonality_new.csv")
selloutData.head(5)

  REGIONID    PRODUCT  YEARWEEK      QTY
0      A60   PRODUCT4    201402     71.0
1      A60  PRODUCT59    201402  22275.0
2      A60  PRODUCT34    201402   4463.0
3      A60  PRODUCT47    201402      0.0
4      A60  PRODUCT56    201402     23.0

In [3]:
selloutData.dtypes

REGIONID     object
PRODUCT      object
YEARWEEK      int64
QTY         float64
dtype: object

### 2.astype으로 타입 바꾸기(데이터 타입 통합)

In [4]:
# selloutData["REGIONID"] = selloutData.YEARWEEK.astype(str)
# selloutData["PRODUCT"] = selloutData.YEARWEEK.astype(str)
selloutData["YEARWEEK"] = selloutData.YEARWEEK.astype(str)
# selloutData["QTY"] = selloutData.YEARWEEK.astype(float)

In [5]:
selloutData.dtypes

REGIONID     object
PRODUCT      object
YEARWEEK     object
QTY         float64
dtype: object

### 3.원하는 컬럼명만 조회하기

In [6]:
import numpy as np

In [7]:
selloutDataC = selloutData[["REGIONID","PRODUCT"]]
selloutDataC.head(5)

  REGIONID    PRODUCT
0      A60   PRODUCT4
1      A60  PRODUCT59
2      A60  PRODUCT34
3      A60  PRODUCT47
4      A60  PRODUCT56

In [8]:
selloutData.head(5)

  REGIONID    PRODUCT YEARWEEK      QTY
0      A60   PRODUCT4   201402     71.0
1      A60  PRODUCT59   201402  22275.0
2      A60  PRODUCT34   201402   4463.0
3      A60  PRODUCT47   201402      0.0
4      A60  PRODUCT56   201402     23.0

### quiz1번 =  불량데이터 처리

In [9]:
selloutData["QTY_NEW"] = np.where(selloutData["QTY"]<0,0,\
                        selloutData["QTY"])
selloutData.head(3)

  REGIONID    PRODUCT YEARWEEK      QTY  QTY_NEW
0      A60   PRODUCT4   201402     71.0     71.0
1      A60  PRODUCT59   201402  22275.0  22275.0
2      A60  PRODUCT34   201402   4463.0   4463.0

### quiz2  = 데이터통합(53주차 제거)

In [10]:
selloutData["YEAR"] = selloutData.YEARWEEK.astype(str)
selloutData["WEEK"] = selloutData.YEARWEEK.astype(str)

In [12]:
selloutData["YEAR"] = selloutData['YEARWEEK'][0:4]
selloutData["WEEK"] = selloutData['YEARWEEK'][4:]

In [14]:
# 컬럼 만들기
selloutData["YEAR"] = selloutData["YEARWEEK"].str[0:4]
selloutData["WEEK"] = selloutData["YEARWEEK"].str[4:]

In [16]:
refinedSelloutData = selloutData[selloutData.WEEK.astype(int) <=52]
refinedSelloutData.head(5)

  REGIONID    PRODUCT YEARWEEK      QTY  QTY_NEW  YEAR WEEK
0      A60   PRODUCT4   201402     71.0     71.0  2014   02
1      A60  PRODUCT59   201402  22275.0  22275.0  2014   02
2      A60  PRODUCT34   201402   4463.0   4463.0  2014   02
3      A60  PRODUCT47   201402      0.0      0.0  2014   02
4      A60  PRODUCT56   201402     23.0     23.0  2014   02

In [19]:
sortKey = ["REGIONID","PRODUCT"]
sortedData = selloutData.sort_values(sortKey)
sortedData.head(5)

     REGIONID    PRODUCT YEARWEEK    QTY  QTY_NEW  YEAR WEEK
205       A00  PRODUCT34   201404  532.0    532.0  2014   04
298       A00  PRODUCT34   201401  661.0    661.0  2014   01
1757      A00  PRODUCT34   201402  679.0    679.0  2014   02
3125      A00  PRODUCT34   201403  578.0    578.0  2014   03
4313      A00  PRODUCT34   201406  423.0    423.0  2014   06

### 6.그룹 묶어서 데이터 요약 심화과정

In [35]:
groupData = sortedData.\
groupby(['REGIONID','PRODUCT']).agg(['mean','std'])['QTY_NEW']
groupData.head(5)

                             mean            std
REGIONID PRODUCT
A00      PRODUCT34     132.445860     154.867743
         PRODUCT58     105.235669     273.435108
         PRODUCT59   36086.547771   15192.174914
A01      PRODUCT1     5716.726115    3704.948589
         PRODUCT12  197052.777070  198866.717131

In [36]:
groupResult = groupData.reset_index()
#항상 그룹으로 해주고 rest_index()를 해줘야 한다.
groupResult.head()

  REGIONID    PRODUCT           mean            std
0      A00  PRODUCT34     132.445860     154.867743
1      A00  PRODUCT58     105.235669     273.435108
2      A00  PRODUCT59   36086.547771   15192.174914
3      A01   PRODUCT1    5716.726115    3704.948589
4      A01  PRODUCT12  197052.777070  198866.717131

In [37]:
sortKey2 = ["REGIONID","PRODUCT","YEARWEEK"]